Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: wddx_serialize_value() is used to create a WDDX packet from a single given value.
es: wddx_serialize_value() se utiliza para crear un paquete WDDX desde un valor simple dado.

source: It takes the value contained in var, and an optional comment string that appears in the packet header, and returns the WDDX packet.
es: Toma el valor contenido en var, y una cadena comentario opcional que aparecera en la cabecera del paquete, y devuelve el paquete WDDX.

source: wddx_serialize_vars() is used to create a WDDX packet with a structure that contains the serialized representation of the passed variables.
es: wddx_serialize_vars() se utiliza para crear un paquete WDDX con una estructura que contiene la representacion serializada de las variables pasadas como parametros.

source: wddx_serialize_vars() takes a variable number of arguments, each of which can be either a string naming a variable or an array containing strings naming the variables or another array, etc.
es: wddx_serialize_vars() toma un numero variable de argumentos, cada uno de los cuales puede ser una cadena con el nombre de una variable o un array con nombres de variables, o de otro array, etc.

source: Example 1. wddx_serialize_vars() example
es: Ejemplo 1. wddx_serialize_vars example

source: ?php $a = 1; $b = 5.5; $c = array("blue", "orange", "violet"); $d = "colors"; $clvars = array("c", "d"); print wddx_serialize_vars("a", "b", $clvars);?
es: ?php $a = 1; $b = 5.5; $c = array("azul", "naranja", "violeta"); $d = "colores"; $clvars = array("c", "d"); print wddx_serialize_vars("a", "b", $clvars);?

source: wddxPacket version=' 1.0 'header / data struct var name='a' number 1 / number / var var name='b 'number 5.5 / number / var var name='c' array length='3 'string blue / string string orange / string string violet / string / array / var var name='d' string colors / string / var / struct / data / wddxPacket
es: wddxPacket version=' 0.9 'header / data struct var name='a' number 1 / number / var var name='b 'number 5.5 / number / var var name='c' array length='3 'string azul / string string naranja / string string violeta / string / array / var var name='d' string colores / string / var / struct / data / wddxPacket

source: The line is broken using the (optional) break parameter.
es: Corta la cadena cad en la columna especificada por el parámetro (opcional) ancho.

source: wordwrap() will automatically wrap at column 75 and break using '\n '(newline) if width or break are not given.
es: La línea se rompe utilizando el parámetro (opcional) ruptura.

source: So if you have a word that is larger than the given width, it is broken apart. (See second example).
es: wordwrap() automáticamente cortará en la columna 75 y usará '\n '(nueva línea) si no se especifican el ancho o la ruptura.

source: The optional cut parameter was added in PHP 4.0.3
es: Ejemplo 1.

source: Example 1. wordwrap() example
es: Ejemplo de wordwrap()

source: Example 2. wordwrap() example
es: Este ejemplo mostraría:

source: See also nl2br().
es: Vea también nl2br().

source: An error code from xml_get_error_code().
es: Un código de error de xml_get_error_code().

source: Returns a string with a textual description of the error code code, or FALSE if no description was found.
es: Devuelve una cadena con una descripción textual del código de error code, o FALSE si no se encontró descripción.

source: A reference to the XML parser to get byte index from.
es: Una referencia al analizador XML del que obtener el índice del byte.

source: This function returns FALSE if parser does not refer to a valid parser, or else it returns which byte index the parser is currently at in its data buffer (starting at 0).
es: Esta función devuelve FALSE si parser no referencia un analizador válido, o si no devuelve en qué índice de byte se encuentra el buffer de datos del analizador (empezando en 0).

source: A reference to the XML parser to get column number from.
es: Una referencia al analizador XML del que obtener el número de columna.

source: This function returns FALSE if parser does not refer to a valid parser, or else it returns which column on the current line (as given by xml_get_current_line_number()) the parser is currently at.
es: Esta función devuelve FALSE si parser no referencia un analizador válido, o si no devuelve en qué columna de la línea actual (como se obtiene de xml_get_current_line_number()) en la que se encuentra el analizador.

source: A reference to the XML parser to get line number from.
es: Una referencia al analizador XML del que obtener el número de línea.

source: This function returns FALSE if parser does not refer to a valid parser, or else it returns which line the parser is currently at in its data buffer.
es: Esta función devuelve FALSE si parser no referencia un analizador válido, o si no devuelve en qué línea se encuentra actualmente el buffer de datos del analizador.

source: A reference to the XML parser to get error code from.
es: Una referencia al analizador XML del que obtener el código de error.

source: This function returns FALSE if parser does not refer to a valid parser, or else it returns one of the error codes listed in the error codes section.
es: Esta función devuelve FALSE si parser no referencia un analizador válido, o si no devuelve uno de los códigos de error listados en la sección de códigos de error.

source: A reference to the XML parser to use.
es: Una referencia al analizador XML que se va a utilizar.

source: Chunk of data to parse.
es: Conjunto de información que se analizará.

source: A document may be parsed piece-wise by calling xml_parse() several times with new data, as long as the is_final parameter is set and TRUE when the last data is parsed.
es: Un documento puede ser analizado por trozos llamando varias veces a xml_parse() con nueva información, siempre que se establezca el parámetro isFinal y sea TRUE cuando el último dato sea analizado.

source: If set and TRUE, data is the last piece of data sent in this parse.
es: Si existe y es TRUE, data es el último pedazo de información envíado en este análisis.

source: When the XML document is parsed, the handlers for the configured events are called as many times as necessary, after which this function returns TRUE or FALSE.
es: Cuando el documento XML es analizado, se hacen llamadas a los gestores para los eventos configurados tantas veces como sea necesario, después de que esta función devuelva TRUE o FALSE.

source: TRUE is returned if the parse was successful, FALSE if it was not successful, or if parser does not refer to a valid parser.
es: Devuelve TRUE si el análisis se realiza con éxito, FALSE si no tiene éxito, o si parser no referencia a un analizador válido.

source: For unsuccessful parses, error information can be retrieved with xml_get_error_code(), xml_error_string(), xml_get_current_line_number(), xml_get_current_column_number() and xml_get_current_byte_index().
es: Para análisis fallidos, se puede recuperar información de error con xml_get_error_code(), xml_error_string(), xml_get_current_line_number(), xml_get_current_column_number() y xml_get_current_byte_index().

source: Example 1. moldb.xml - small database of molecular information
es: Ejemplo 1. moldb.xml - small database of molecular information

source: Example 2. parsemoldb.php - parses moldb.xml into and array of molecular objects
es: Ejemplo 2. parsemoldb.php - parses moldb.xml into and array of molecular objects

source: Which character encoding the parser should use.
es: Qué codificación de caracteres debería usar el analizador.

source: The following character encodings are supported:
es: Las siguientes codificación de caracteres están soportadas:

source: ISO-8859-1 (default)
es: ISO-8859-1 (por defecto)

source: A reference to the XML parser to free.
es: Una referencia al analizador XML que se liberará.

source: This function returns FALSE if parser does not refer to a valid parser, or else it frees the parser and returns TRUE.
es: Esta función devuelve FALSE si parser no referencia un analizador válido, o si no libera el analizador y devuelve TRUE.

source: A reference to the XML parser to get an option from.
es: Una referencia al analizador XML del que obtener opciones.

source: Which option to fetch.
es: Qué opción recuperar.

source: See xml_parser_set_option() for a list of options.
es: Ver xml_parser_set_option() para una lista de opciones.

source: This function returns FALSE if parser This function returns FALSE if parser does not refer to a valid parser, or if the option could not be set.
es: Esta función devuelve FALSE si parser no referencia un analizador válido, o si la opción no pudo ser establecida.

source: Else the option 's value is returned.
es: Si no, se devuelve la opción.

source: See xml_parser_set_option() for the list of options.
es: Mirar xml_parser_set_option() para la lista de opciones.

source: A reference to the XML parser to set an option in.
es: Una referencia al analizador XML en el que establecer opciones.

source: Which option to set.
es: Opción que se establecerá.

source: See below.
es: Ver más abajo.

source: The option 's new value.
es: El nuevo valor de la opción.

source: Else the option is set and TRUE is returned.
es: Si no, la opción se establece y devuelve TRUE.

source: The following options are available:
es: Las opciones siguientes están disponibles:

source: XML parser options
es: Opciones de analizador XML

source: Option constant
es: Opción constante

source: Data type
es: Tipo de Datos

source: Controls whether case-folding is enabled for this XML parser.
es: Controla si case-folding Controla si case-folding se habilita para este analizador XML.

source: Enabled by default.
es: Habilitado por defecto.

source: Sets which target encoding Sets which target encoding to use in this XML parser.
es: Establece qué codificación destino se usa en este analizador XML.

source: By default, it is set to the same as the source encoding used by xml_parser_create().
es: Por defecto, esta puesta al mismo que la codificación fuente usada por xml_parser_create().

source: Supported target encodings are ISO-8859-1, US-ASCII and UTF-8.
es: Las codificaciones de destino soportadas son ISO-8859-1, US-ASCII y UTF-8.

source: Sets the character data handler function for the XML parser parser. handler is a string containing the name of a function that must exist when xml_parse() is called for parser.
es: Establece la función gestora de datos de caracteres para el analizador XML parser. handler es un string que contiene el nombre de la función que debe existir cuando xml_parse() es llamado por parser.

source: The function named by handler must accept two parameters: handler (resource parser, string data)
es: La función nombrada en handler debe aceptar dos parámetros: handler (int parser, string data)

source: The first parameter, parser, is a reference to the XML parser calling the handler.
es: El primer parámetro, parser, es una referencia al analizador XML que llama al gestor.

source: The second parameter, data, contains the character data as a string.
es: El segundo parámetro, data, contiene los datos caracteres como string.

source: If a handler function is set to an empty string, or FALSE, the handler in question is disabled.
es: Si una función gestora se establece como la cadena vacía, o FALSE, el gestor en cuestión se deshabilita.

source: TRUE is returned if the handler is set up, FALSE if parser is not a parser.
es: Se devuelve TRUE si se estableció el gestor, FALSE si parser no es un analizador.

source: Instead of a function name, an array containing an object reference and a method name can also be supplied.
es: En la actualidad no hay soporte para gestores objeto / método.

source: Sets the default handler function for the XML parser parser. handler is a string containing the name of a function that must exist when xml_parse() is called for parser.
es: Establece la función gestora por defecto para un analizador XML parser. handler es un string que contiene el nombre de la función que debe existir cuando xml_parse() es llamado por parser.

source: The second parameter, data, contains the character data.
es: El segundo parámetro, data, contiene los caracteres de dato.

source: This may be the XML declaration, document type declaration, entities or other data for which no other handler exists.
es: Esto puede ser la declaración XML, la declaración de tipo de documento, entidades u otros datos para los cuales no existe otro gestor.

source: Sets the element handler functions for the XML parser parser. start_element_handler and end_element_handler are strings containing the names of functions that must exist when xml_parse() is called for parser.
es: Establece las funciones de gestion de elementos para el analizador XML parser. startElementHandler y endElementHandler son strings que contienen los nombres de las funciones que deben existir cuando xml_parse() es llamado por parser.

source: The function named by start_element_handler must accept three parameters: start_element_handler (resource parser, string name, array attribs)
es: La función denominada startElementHandler debe aceptar tres parámetros: startElementHandler (int parser, string name, string attribs)

source: The second parameter, name, contains the name of the element for which this handler is called.
es: El segundo parámetro, name, contiene el nombre del elemento para el que se llama a este gestor.

source: If case-folding is in effect for this parser, the element name will be in uppercase letters.
es: Si la propiedad de case-folding tiene efecto para este analizador, el nombre del elemento estará en mayúsculas.

source: The third parameter, attribs, contains an associative array with the element' s attributes (if any).
es: El tercer parámetro, attribs, contiene un array asociativo con los atributos de los elementos (si hay).

source: The keys of this array are the attribute names, the values are the attribute values.
es: Las claves de este array son los nombres de los atributos, los valores son los valores de los atributos.

source: Attribute names are case-folded on the same criteria as element names.
es: Los nombres de los atributos están en mayúsculas (case-folded) con el mismo criterio que los nombres de los elementos.

source: Attribute values are not case-folded.
es: Los valores de los atributos no sufren las consecuencias de case-folding.

source: The original order of the attributes can be retrieved by walking through attribs the normal way, using each().
es: El orden original de los atributos se puede recuperar recorriendo attribs del modo usual, usando each().

source: The first key in the array was the first attribute, and so on.
es: La primera clave del array es el el primer atributo, y así sucesivamente.

source: The function named by end_element_handler must accept two parameters: end_element_handler (resource parser, string name)
es: La función llamada endElementHandler debe aceptar dos parámetros: endElementHandler (int parser, string name)

source: TRUE is returned if the handlers are set up, FALSE if parser is not a parser.
es: Se devuelve TRUE si se establecieron los gestores, FALSE si parser no es un analizador.

source: Sets the external entity reference handler function for the XML parser parser. handler is a string containing the name of a function that must exist when xml_parse() is called for parser.
es: Establece la función gestora de declaraciones de notación para el analizador XML parser. handler es un string que contiene el nombre de una función que debe existir cuando xml_parse() es llamado por parser.

source: The function named by handler must accept five parameters, and should return an integer value.
es: La función llamada por handler debe aceptar cinco parámetros, y debería devolver un valor entero.

source: If the value returned from the handler is FALSE (which it will be if no value is returned), the XML parser will stop parsing and xml_get_error_code() will return XML_ERROR_EXTERNAL_ENTITY_HANDLING. handler (resource parser, string open_entity_names, string base, string system_id, string public_id)
es: Si el valor devuelto desde el gestor (handler) es falso (lo cual ocurrirá si no se devuelve un valor), el analizador XML dejará de analizar y xml_get_error_code() devolverá XML_ERROR_EXTERNAL_ENTITY_HANDLING. int handler (int parser, string openEntityNames, string base, string systemId, string publicId)

source: The second parameter, open_entity_names, is a space-separated list of the names of the entities that are open for the parse of this entity (including the name of the referenced entity).
es: El segundo parámetro, openEntityNames, es una lista, separada por espacios, de los nombres de las entidades que se abren para el análisis de esta entidad (incluido el nombre de la entidad referenciada).

source: This is the base for resolving the system identifier (system_id) of the external entity.
es: Esta es la base para resolver el identificador de sistema (systemid) de la entidad externa.

source: Currently this parameter will always be set to an empty string.
es: En la actualidad este parámetro es siempre la cadena vacía.

source: The fourth parameter, system_id, is the system identifier as specified in the entity declaration.
es: El cuarto parámetro, systemId, es el identificador del sistema tal como se especificó en la declaración de la entidad.

source: The fifth parameter, public_id, is the public identifier as specified in the entity declaration, or an empty string if none was specified; the whitespace in the public identifier will have been normalized as required by the XML spec.
es: El quinto parámetro, publicId, es el identificador público como se especificó en la declaración de la entidad, o una cadena vacía si no se especificó ninguno; el espacio en blanco en el identificador público se habrá normalizado como se requiere en las especificaciones XML.

source: Sets the notation declaration handler function for the XML parser parser. handler is a string containing the name of a function that must exist when xml_parse() is called for parser.
es: Establece las funciones gestoras de declaraciones de notación para el analizador XML parser. handler es un string que contiene el nombre de una función que debe existir cuando xml_parse() es llamado por parser.

source: A notation declaration is part of the document 's DTD and has the following format:
es: Una declaración de notación es parte del DTD del documento y tiene el siguiente formato:

source: The function named by handler must accept five parameters: handler (resource parser, string notation_name, string base, string system_id, string public_id)
es: La función llamada por handler debe aceptar cinco parámetros: handler (int parser, string notationName, string base, string systemId, string publicId)

source: This is the notation 's name, as per the notation format described above.
es: Este es el nombre de la notación, como se describió arriba en el formato de notación.

source: This is the base for resolving the system identifier (system_id) of the notation declaration.
es: Esta es la base para resolver el identificador de sistema (systemId) de la declaración.

source: System identifier of the external notation declaration.
es: Identificador de sistema de la declaración de notación externa.

source: Public identifier of the external notation declaration.
es: Identificador público de la declaración de notación externa.

source: This function allows to use parser inside object.
es: Esta función hace a parser utilizable dentro de object.

source: All callback functions could be set with xml_set_element_handler() etc and assumed to be methods of object.
es: Todas las funciones de callback establecidas por xml_set_element_handler() etc se asumen como métodos de object.

source: Sets the processing instruction (PI) handler function for the XML parser parser. handler is a string containing the name of a function that must exist when xml_parse() is called for parser.
es: Establece ela función de gestión de instrucciones de procesado (PI) para el analizador XML parser. handler es un string que contiene el nombre de una función que debe existir cuando xml_parse() es llamada por parser.

source: A processing instruction has the following format:
es: Una instrucción de procedado tiene el siguiente formato:

source: The function named by handler must accept three parameters: handler (resource parser, string target, string data)
es: La función nombrada en handler debe aceptar tres parámetros: handler (int parser, string target, string data)

source: The second parameter, target, contains the PI target.
es: El segundo parámetro, target, contiene el objetivo PI.

source: The third parameter, data, contains the PI data.
es: El tercer parámetro, data, contiene los datos PI.

source: Sets the unparsed entity declaration handler function for the XML parser parser. handler is a string containing the name of a function that must exist when xml_parse() is called for parser.
es: Establece la función gestora de declaración de entidades no analizadas para el analizador XML parser. handler es una cadena que contiene el nombre de una función que debe existir cuando xml_parse() es llamada por parser.

source: This handler will be called if the XML parser encounters an external entity declaration with an NDATA declaration, like the following:
es: Este gestor será llamado si el analizador XML encuentra una declaración de entidades externas con una declaración NDATA, como la siguiente:

source: See section 4.2.2 of the XML 1.0 spec for the definition of notation declared external entities.
es: Mira la sección 4.2.2 de las especificaciones XML 1.0 para la definición de entidades externas de notación declarada.

source: The function named by handler must accept six parameters: handler (resource parser, string entity_name, string base, string system_id, string public_id, string notation_name)
es: La función nombrada en handler debe aceptar seis parámetros: handler (int parser, string entityName, string base, string systemId, string publicId, string notationName)

source: The name of the entity that is about to be defined.
es: El nombre de la entidad que va a ser definida.

source: This is the base for resolving the system identifier (systemId) of the external entity.
es: Esta es la base para resolver el identificador de sistema (systemId) de la entidad externa.

source: System identifier for the external entity.
es: Identificador de Sistema para la entidad externa.

source: Public identifier for the external entity.
es: Identificador público para la entidad externa.

source: Name of the notation of this entity (see xml_set_notation_decl_handler()).
es: Nombre de la notación de esta entidad (ver xml_set_notation_decl_handler()).

source: Create and return a new XSLT processor resource for manipulation by the other XSLT functions.
es: This handle is needed in all subsequent calls to XSL functions.

source: Return an error code describing the last error that occured on the passed XSLT processor.
es: If no handle is given, the last error number that occured anywhere is returned.

source: Handling errors using the xslt_error() and xslt_errno() functions.
es: Return the current error string of the given XSL processor.

source: ?php $xh = xslt_create(); $result = xslt_process($xh, 'dog.xml', 'pets.xsl'); if (!$result) {die(sprintf("Cannot process XSLT document [%d]: %s", xslt_errno($xh), xslt_error($xh)));} print($result); xslt_free($xh);?
es: If no handle is given, the last error string that occured anywhere is returned.

source: xslt_process
es: xslt_output_process

source: In these cases you 'll have the XML and / or XSLT data in a variable - - and in production applications the overhead of dumping these to file may be too much.
es: (no version information, might be only in CVS)
